#pragma once

#ifdef LIBTIER0_EXPORTS
#define LIBTIER0_EXPORT EXPORT_DLLEXPORT
#else
#define LIBTIER0_EXPORT EXPORT_DLLIMPORT
#endif

#define func auto
#define let const auto &
#define var auto

#define implicit

#define operator_assign operator =
#define operator_convert(T) operator T
#define operator_delete operator delete
#define operator_get operator *
#define operator_get_at operator []
#define operator_get_ptr operator ->
#define operator_invoke operator ()
#define operator_new operator new
#define operator_udl(_t) operator ""_t

#if 0
#elif defined(__clang__)
#define COMPILER_IS_CLANG 1
#define COMPILER_IS_GCC 0
#define COMPILER_IS_MSVC 0
#elif defined(__GNUC__)
#define COMPILER_IS_CLANG 0
#define COMPILER_IS_GCC 1
#define COMPILER_IS_MSVC 0
#elif defined(_MSC_VER)
#define COMPILER_IS_CLANG 0
#define COMPILER_IS_GCC 0
#define COMPILER_IS_MSVC 1
#else
#error "Unknown compiler"
#endif

#if COMPILER_IS_MSVC
#define EXPORT_DLLEXPORT __declspec(dllexport)
#define EXPORT_DLLIMPORT __declspec(dllimport)
#else
#define EXPORT_DLLEXPORT __attribute__((visibility("default")))
#define EXPORT_DLLIMPORT
#endif

#ifndef USE_PRIMITIVE_WRAPPERS
#define USE_PRIMITIVE_WRAPPERS 1
#endif

#if COMPILER_IS_MSVC
#undef USE_PRIMITIVE_WRAPPERS
#define USE_PRIMITIVE_WRAPPERS 0
#endif

#if COMPILER_IS_CLANG
#define ATTR_TYPESTATE_TYPE [[clang::consumable(unknown)]]
#define ATTR_TYPESTATE_CTOR(state) [[clang::return_typestate(state)]]
#define ATTR_TYPESTATE_PRECONDITION(state) [[clang::callable_when(state)]]
#define ATTR_TYPESTATE_ASSERTS(state) [[clang::test_typestate(state)]]
#else
#define ATTR_TYPESTATE_TYPE
#define ATTR_TYPESTATE_CTOR(state)
#define ATTR_TYPESTATE_PRECONDITION(state)
#define ATTR_TYPESTATE_ASSERTS(state)
#endif

#define PAD(n) PAD_1(__LINE__, n)
#define PAD_1(uniq, n) PAD_2(uniq, n)
#define PAD_2(uniq, n) decltype(' ') _padding##uniq[n] {};

#define PAD_BEGIN \
    _Pragma("clang diagnostic push") \
    _Pragma("warning(push)") \
    _Pragma("clang diagnostic ignored \"-Wpadded\"") \
    _Pragma("warning(disable : 4820)") \
    /**/

#define PAD_END \
    _Pragma("clang diagnostic pop") \
    _Pragma("warning(pop)") \
    /**/

namespace tier0 {
    LIBTIER0_EXPORT void dummy();
}

// meta
namespace tier0 {

#include "../macros.h"

#define METAFUNC_TYPE(name, args) \
    template <MAP(METAFUNC_IMPL_DECLARE_ARGS, METAFUNC_IMPL_DELIMITER_COMMA, args)> \
    struct name##_s; \
    template <MAP(METAFUNC_IMPL_DECLARE_ARGS, METAFUNC_IMPL_DELIMITER_COMMA, args)> \
    using name = typename name##_s<MAP(METAFUNC_IMPL_DECLARE_FORWARD, METAFUNC_IMPL_DELIMITER_COMMA, args)>::type;
#define METAFUNC_TYPE_IMPL(name, spec, args, val) \
    template <MAP(METAFUNC_IMPL_DECLARE_ARGS, METAFUNC_IMPL_DELIMITER_COMMA, args)> \
    struct name##_s IF_EMPTY(spec, METAFUNC_IMPL_SPECIALIZE_0, METAFUNC_IMPL_SPECIALIZE_1)(spec) { \
        using type = val; \
    };

// #define METAFUNC_VALUE_DEF concept
#define METAFUNC_VALUE_DEF static constexpr auto

#define METAFUNC_VALUE(name, args) \
    template <MAP(METAFUNC_IMPL_DECLARE_ARGS, METAFUNC_IMPL_DELIMITER_COMMA, args)> \
    struct name##_s; \
    template <MAP(METAFUNC_IMPL_DECLARE_ARGS, METAFUNC_IMPL_DELIMITER_COMMA, args)> \
    METAFUNC_VALUE_DEF name = name##_s<MAP(METAFUNC_IMPL_DECLARE_FORWARD, METAFUNC_IMPL_DELIMITER_COMMA, args)>::value;
#define METAFUNC_VALUE_IMPL(name, spec, args, val) \
    template <MAP(METAFUNC_IMPL_DECLARE_ARGS, METAFUNC_IMPL_DELIMITER_COMMA, args)> \
    struct name##_s IF_EMPTY(spec, METAFUNC_IMPL_SPECIALIZE_0, METAFUNC_IMPL_SPECIALIZE_1)(spec) { \
        METAFUNC_VALUE_DEF value = val; \
    };

#define METAFUNC_IMPL_DELIMITER_COMMA() ,
#define METAFUNC_IMPL_DECLARE_ARGS(it) LIST_GET(it, 1) LIST_GET(it, 0)
#define METAFUNC_IMPL_DECLARE_FORWARD(it) LIST_GET(it, 0)
#define METAFUNC_IMPL_SPECIALIZE_0(spec)
#define METAFUNC_IMPL_SPECIALIZE_1(spec) <MAP(METAFUNC_IMPL_SPECIALIZE_1_ARG, METAFUNC_IMPL_DELIMITER_COMMA, spec)>
#define METAFUNC_IMPL_SPECIALIZE_1_ARG(it) it

#if defined(TEST_MACROS)
    // expect METAFUNC_TYPE : template <bool predicate , typename T , typename F> struct cond_s; template <bool predicate , typename T , typename F> using cond = typename cond_s<predicate , T , F>::type;
    METAFUNC_TYPE(cond, ((predicate, bool), (T, typename), (F, typename)))
    // expect METAFUNC_TYPE_IMPL : template <typename T , typename F> struct cond_s <true , T , F> { using type = T; };
    METAFUNC_TYPE_IMPL(cond, (true, T, F), ((T, typename), (F, typename)), T)
    // expect METAFUNC_TYPE_IMPL : template <typename T , typename F> struct cond_s <false , T , F> { using type = F; };
    METAFUNC_TYPE_IMPL(cond, (false, T, F), ((T, typename), (F, typename)), F)
#endif

    METAFUNC_TYPE(remove_reference, ((T, typename)))
    METAFUNC_TYPE_IMPL(remove_reference, (T && ), ((T, typename)), T)
    METAFUNC_TYPE_IMPL(remove_reference, (T & ), ((T, typename)), T)
    METAFUNC_TYPE_IMPL(remove_reference, (), ((T, typename)), T)

    METAFUNC_TYPE(cond, ((predicate, bool), (T, typename), (F, typename)))
    METAFUNC_TYPE_IMPL(cond, (true, T, F), ((T, typename), (F, typename)), T)
    METAFUNC_TYPE_IMPL(cond, (false, T, F), ((T, typename), (F, typename)), F)

    METAFUNC_VALUE(is_same, ((T, typename), (U, typename)))
    METAFUNC_VALUE_IMPL(is_same, (T, T), ((T, typename)), true)
    METAFUNC_VALUE_IMPL(is_same, (), ((T, typename), (U, typename)), false)

    METAFUNC_VALUE(is_const, ((T, typename)))
    METAFUNC_VALUE_IMPL(is_const, (const T), ((T, typename)), true)
    METAFUNC_VALUE_IMPL(is_const, (), ((T, typename)), false)

    METAFUNC_TYPE(add_const, ((T, typename)))
    METAFUNC_TYPE_IMPL(add_const, (const T), ((T, typename)), const T)
    METAFUNC_TYPE_IMPL(add_const, (), ((T, typename)), const T)

    METAFUNC_TYPE(remove_const, ((T, typename)))
    METAFUNC_TYPE_IMPL(remove_const, (const T), ((T, typename)), T)
    METAFUNC_TYPE_IMPL(remove_const, (), ((T, typename)), T)

    namespace detail {
        using _false = char[1];
        using _true = char[2];

#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-template"

        template<typename T>
        static _true *test(T *) { return nullptr; }

        template<typename>
        static _false *test(void *) { return nullptr; }

#pragma clang diagnostic pop
    }

    METAFUNC_VALUE(is_base_of, ((Super, typename), (Self, typename)))
    METAFUNC_VALUE_IMPL(is_base_of, (), ((Super, typename), (Self, typename)),
                        sizeof(*detail::test<Super>(static_cast<Self *>(nullptr))) == sizeof(detail::_true))
}

// memory model
namespace tier0 {
    using cstring = char const *;

    template<typename T>
    using ref = const T &;

    template<typename T>
    using mut_ref = T &;

    template<typename T>
    using movable = T &&;

    template<typename T>
    [[gnu::always_inline]]
    constexpr movable<remove_reference<T>> move(movable<T> value) {
        return movable<remove_reference<T>>(value);
    }

    template<typename T, typename U>
    constexpr T exchange(mut_ref<T> target, movable<U> replacement) {
        var ret = move(target);
        target = replacement;
        return ret;
    }

    template<typename T>
    struct native_s {
        using type = T;
    };

    template<typename T>
    using Native = typename native_s<T>::type;
}

// mptr
namespace tier0 {
    template<typename T, typename R>
    struct mptr;

    template<typename T, typename R>
    mptr(R T::*) -> mptr<T, R>;

    template<typename T, typename R>
    struct mptr {
        using native = R T::*;
        native data_;

        [[gnu::always_inline]]
        implicit constexpr mptr(native data) : data_(data) {}

        [[gnu::always_inline]]
        constexpr ref<R> get(ref<T> obj) const { return obj.*data_; }

        [[gnu::always_inline]]
        constexpr mut_ref<R> get(mut_ref<T> obj) const { return obj.*data_; }

        template<typename... Ts>
        [[gnu::always_inline]]
        constexpr auto call(mut_ref<T> obj, Ts... args) const { return (obj.*data_)(args...); }
    };
}

// members
namespace tier0 {
    namespace detail {
        template<auto... members>
        struct mptr_first_class_s;

        template<typename T, typename R, R T::*v, auto... rest>
        struct mptr_first_class_s<v, rest...> {
            using type = T;
        };

        template<typename E>
        struct mptr_expect_class_s {
            template<auto v>
            struct test;

            template<typename R, R E::*v>
            struct test<v> {
                METAFUNC_VALUE_DEF value = v;
            };
        };

        template<typename T, auto... members>
        struct Members;

        template<auto... members>
        struct members_s {
            using Base = typename mptr_first_class_s<members...>::type;
            using type = Members<Base, mptr_expect_class_s<Base>::template test<members>::value...>;
        };

        template<typename T, auto... members>
        struct Members {
            [[gnu::always_inline]]
            static constexpr void swap(mut_ref<T> a, mut_ref<T> b) {
                (swap_<members>(a, b), ...);
            }

            template<auto member>
            [[gnu::always_inline]]
            static constexpr void swap_(mut_ref<T> a, mut_ref<T> b) {
                var field = mptr(member);
                var tmp = move(field.get(a));
                field.get(a) = move(field.get(b));
                field.get(b) = move(tmp);
            }
        };
    }

    template<auto... members>
    using Members = typename detail::members_s<members...>::type;
}

// order
namespace tier0 {
    enum class Order {
        Before = -1,
        Undefined,
        After,
    };
}

// primitives
namespace tier0 {
    using Boolean_t = bool;

    using Char_t = char;
    using UChar_t = unsigned char;
    using SChar_t = signed char;

    using Byte_t = UChar_t;
    using Int8_t = SChar_t;

    using Short_t = short signed int;
    using UShort_t = short unsigned int;

    using Int_t = signed int;
    using UInt_t = unsigned int;
#if defined(_WIN64)
    // ILP32 || LLP64
#define extra_long long
#else
#define extra_long
#endif
    using Long_t = extra_long long signed int;
    using ULong_t = extra_long long unsigned int;

    using Float_t = float;

    using Double_t = double;

#if COMPILER_IS_MSVC
    using Size_t = size_t;
#else
    using Size_t = ULong_t;
#endif

#define PRIdZ "zd"
#define PRIuZ "zu"

    static_assert(sizeof(Boolean_t) == 1);
    static_assert(sizeof(Char_t) == 1);
    static_assert(sizeof(Short_t) == 2);
    static_assert(sizeof(Int_t) == 4);
    static_assert(sizeof(Long_t) == 8);
    static_assert(sizeof(Float_t) == 4);
    static_assert(sizeof(Double_t) == 8);
    static_assert(sizeof(Size_t) == sizeof(void *));

    namespace detail {
        METAFUNC_VALUE(is_arithmetic, ((T, typename)))

        template<typename T>
        struct is_arithmetic_s {
            METAFUNC_VALUE_DEF value = is_same < Boolean_t, T>
            || is_same <Char_t, T> || is_same <UChar_t, T> || is_same <SChar_t, T>
            || is_same <Short_t, T> || is_same <UShort_t, T>
            || is_same <Int_t, T> || is_same <UInt_t, T>
            || is_same<long signed int, T> || is_same<long unsigned int, T>
            || is_same <Long_t, T> || is_same <ULong_t, T>
            || is_same <Float_t, T>
            || is_same<Double_t, T>;
        };

        template<typename T>
        struct WordTraits;

        struct WordTag {
        };

        template<typename T> requires is_arithmetic<T>
        struct Word : WordTag {
            friend WordTraits<Word>;
            T data_;

